#有一个菜单,菜单上有菜品对应的价格(思考菜单的储存方式)
# 鱼香肉丝 15
# 宫保鸡丁 20
# 红烧肉 30
# 水煮鱼 40
#1.显示菜单
#2.询问用户的余额
#3.根据用户的余额,来为用户查找可以选择的套餐
#4.用户选择套餐

menu={
    "鱼香肉丝":15,
    "宫保鸡丁":20,
    "红烧肉":30,
    "水煮鱼":40

}
for i in menu:
    print(i,menu[i])

money=float(input("请输入用户余额："))
print("-"*30)
if money>=15:
    print("你可以选择的套餐有：")
    print("鱼香肉丝，需要15元")
    if money>=20:
        print("宫保鸡丁，需要20元")
        if money>=30:
            print("红烧肉，需要30元")
            if money>=40:
                print("水煮鱼，需要40元")
else :
    print("对不起，你的余额不足！")
